stressTesting/stress.yml
config:
  target: 'http://localhost:8008'
  phases: 
    - duration: 60
      arrivalRate: 1000
  processor: "./riakStressTest.js"

scenarios:
  - flow:
    - function: "randomNum"
    - get: 
        url: '/overview/{{ id }}'
    # - function: "randomData"
    # - post:
    #       url: "/overview/{{ id }}"
    #       json: "{{ data }}"